In [1]:
import pandas as pd

## Importer data

#### "pd" for at anvende panads biblotektet

#### "read", data filen læses, kommando fra pandas

In [35]:
data = pd.read_csv('people.csv')

####   "head()".  Viser de første 5 rækker i sit data sæt

In [11]:
data.head()

          name           address  age
0  Christoffer   Tomsgårdsvej 20   28
1     Caroline  Nybrovej 304 J17   26
2         Anne     Tjele Alle 12   57
3        Patti   Tomsgårdsvej 20   28
4          Per     Tjele Alle 12   56

In [14]:
data['name'] # Giver alle navne ud, man kan også skrive alder eller adresse foreksempel.

0    Christoffer
1       Caroline
2           Anne
3          Patti
4            Per
5          Julia
Name: name, dtype: object

In [15]:
data[['name','age']] # Giver alle navne og alder ud.

          name  age
0  Christoffer   28
1     Caroline   26
2         Anne   57
3        Patti   28
4          Per   56
5        Julia   24

In [44]:
young_adults = data[data['age']< 30] # Viser alle dem er under 30

young_adults['age'].mean() # Beregner middelværdien af de unges alder.

26.5

## "describe()""

#### Giver de mest almindelige statestikker

In [45]:
young_adults.describe()

             age
count   4.000000
mean   26.500000
std     1.914854
min    24.000000
25%    25.500000
50%    27.000000
75%    28.000000
max    28.000000

In [39]:
data[data['name'] == 'Anne'] # Finder alle personerne der hedder Anne

   name               address  age
2  Anne  Tjele Alle 12 Lyngby   57

In [34]:
data[data['name'].str.startswith('C')]  # Finder alle dem der starter med C

          name           address  age
0  Christoffer   Tomsgårdsvej 20   28
1     Caroline  Nybrovej 304 J17   26